import React from 'react'
import './About.css'
import lmsLabel from '../img/lms_label.jpeg' // Correct import

function About() {
    return (
        <div className='about-box'>
            <h2 className="about-title">About the Library</h2>
            <div className="about-data">
                <div className="about-img">
                    <img src={lmsLabel} alt="" />
                </div>
                <div>
                    <p className="about-text">
                        பள்ளி நூலகம் என்பது மாணவர்கள் பாடப்புத்தகங்களுக்கு அப்பாற்பட்டு அறிவை வளர்த்துக்கொள்ளும் அறிவுக் களஞ்சியம் ஆகும். இதில் கதைகள், பாடப்புத்தகங்கள் தொடர்பான குறிப்புகள், செய்தித்தாள்கள், இதழ்கள் போன்றவை இடம்பெற்று, மாணவர்களின் வாசிப்பு பழக்கத்தை மேம்படுத்துகிறது.<br/>
                        <br/>
                       தமிழ் மற்றும் ஆங்கில நூல்கள் மாணவர்களுக்கு எளிதில் புரிந்து கொள்ளவும், மொழித் திறனை மேம்படுத்தவும் உதவுகின்றன. அமைதியான சூழலில் நூலகம் கவனம், ஒழுக்கம், சுயமாகப் படிக்கும் பழக்கத்தை வளர்க்கிறது. நூலகர் வழிகாட்டுதலுடன் மாணவர்கள் பயனுள்ள நூல்களை தேர்வு செய்து படிக்கலாம்.<br/>
                        <br/>
                        சிறந்த நூலகம் மாணவர்களுக்கு தன்னம்பிக்கை, படைப்பாற்றல் மற்றும் வாழ்நாள் முழுதும் கற்றுக் கொள்வதற்கான பழக்கத்தை வழங்குகிறது.<br/>
                        <br/>
                        அறிவே செல்வம்!
                    </p>
                </div>
            </div>
        </div>
    )
}

export default About
